compressible/rhoPimpleFoam/LES/marinePropeller/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.6 -1.20 -0.6)
    ( 0.6 -1.20 -0.6)
    ( 0.6  1.20 -0.6)
    (-0.6  1.20 -0.6)
    (-0.6 -1.20  0.6)
    ( 0.6 -1.20  0.6)
    ( 0.6  1.20  0.6)
    (-0.6  1.20  0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 80 40) simpleGrading (1 1 1)
//    hex (0 1 2 3 4 5 6 7) (20 40 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
    freestream
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);

// ************************************************************************* //
