compressible/rhoPimpleFoam/LES/marinePropeller/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      MRFProperties;
}
mrf_v_fluid_rotor
{
    cellZone        v_fluid_rotor;
    active          false;
    origin          ( 0 0 0 );
    axis            ( 0 1 0 );
    omega           table ( ( 0 0 ) ( 200 0 ) ( 300 157.14 ) ( 10000 157.14 ) );
}

// ************************************************************************* //
