compressible/rhoPimpleFoam/LES/marinePropeller/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    freestream
    {
        type            inletOutlet;
        inletValue      $internalField;
	value		$internalField;
    }

    "propeller.*"
    {
        type            zeroGradient;
    }

    propellerStem_outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "AMI.*"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}

// ************************************************************************* //
