compressible/rhoPimpleFoam/LES/marinePropeller/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{

    default             cellLimited Gauss linear 1.0;
    grad(p)             Gauss linear;
    grad(U)             Gauss linear;

}

divSchemes
{
//    div(phi,U)          Gauss linearUpwind grad(U);
    div(phi,U)		Gauss DEShybrid linear linearUpwind grad(U) delta 0.65 5 0.224 0 1 1.0e-03;
    div(phi,e)          Gauss limitedLinear 1.0;
    div(phi,h)          Gauss limitedLinear 1.0;
    div(phi,omega)      Gauss limitedLinear 1.0;
    div(phi,k)          Gauss limitedLinear 1.0;
    div(phi,nuTilda)    Gauss limitedLinear 1.0;
    div(phi,K)          Gauss linear;
    div(phiv,p)         Gauss linear;
    div(meshPhi,p)      Gauss linear;
    div(phi,Ekp)        Gauss limitedLinear 1.0;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected limited 0.333;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected limited 0.333;
}

wallDist
{
    method meshWave;
    nRequired false;
}
// ************************************************************************* //
