compressible/rhoPimpleFoam/LES/marinePropeller/system/noiseDict-points
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      noiseDict;
}
noiseModel      pointNoise;

pointNoiseCoeffs
{
    outputPrefix    pressurePoint5;
    windowModel     Hanning;
    HanningCoeffs
    {
        overlapPercent  50;
        symmetric       yes;
        extended        yes;
    }
    files           ( "postProcessing/probes_pGauge/0/pGauge" );
    nHeaderLine     15007;
    refColumn       0;
    componentColumns ( 5 );
    mergeSeparators yes;
    separator       " ";
    N               10000;
    rhoRef          1;
    fl              2;
}

// ************************************************************************* //
