compressible/rhoPimpleFoam/LES/marinePropeller/system/noiseDict-surface
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      noiseDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

noiseModel      surfaceNoise;

surfaceNoiseCoeffs
{
    windowModel     Hanning;
    HanningCoeffs
    {
        // Window overlap percentage
        overlapPercent  50;
        symmetric       yes;
        extended        yes;

        // Optional number of windows, default = all available
        //nWindow         5;
    }

    // Input file
    file        "postProcessing/cuttingPlane/xNormal_0/xNormal_0.case";

    // Surface reader
    reader      ensight;

    // Surface writer
    writer      ensight;

    // Collate times for ensight output - ensures geometry is only written once
    writeOptions
    {
        ensight
        {
            collateTimes    1;
            format          binary;
        }
    }

    // Pressure field
    p               pGauge;

    // Number of samples in sampling window
    // Must be a power of 2, default = 2^16 (=65536)
    N               5000;

    rhoRef          1;

    fl 1;

    // Start time, default = 0s
    startTime       1.5;
}

// ************************************************************************* //
