compressible/rhoPimpleFoam/LES/marinePropeller/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

innerCylinderSmall.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

outerCylinder.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

propellerStem1.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

propellerStem2.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

propellerStem3.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

propellerTip.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

outerSphere.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}
// ************************************************************************* //
