compressible/rhoPimpleFoam/LES/marinePropeller/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    v_fluid_tunnel;
        type    cellZoneSet;
        action  new;
        source  zoneToCell;
        zone    v_fluid_rotor;
    }
    {
        name    v_fluid_tunnel;
        type    cellZoneSet;
        action  invert;
    }
);

// ************************************************************************* //
